{
  "class_name": "Model", 
  "keras_version": "2.1.5", 
  "config": {
    "layers": [
      {
        "class_name": "InputLayer", 
        "config": {
          "dtype": "float32", 
          "batch_input_shape": [
            null, 
            2912
          ], 
          "name": "input_char", 
          "sparse": false
        }, 
        "inbound_nodes": [], 
        "name": "input_char"
      }, 
      {
        "class_name": "Embedding", 
        "config": {
          "embeddings_initializer": {
            "class_name": "RandomUniform", 
            "config": {
              "maxval": 0.05, 
              "seed": null, 
              "minval": -0.05
            }
          }, 
          "name": "embedding_1", 
          "dtype": "float32", 
          "output_dim": 50, 
          "trainable": true, 
          "embeddings_regularizer": null, 
          "input_dim": 51, 
          "mask_zero": true, 
          "embeddings_constraint": null, 
          "batch_input_shape": [
            null, 
            null
          ], 
          "activity_regularizer": null, 
          "input_length": null
        }, 
        "inbound_nodes": [
          [
            [
              "input_char", 
              0, 
              0, 
              {}
            ]
          ]
        ], 
        "name": "embedding_1"
      }, 
      {
        "class_name": "Conv1DMask", 
        "config": {
          "kernel_constraint": null, 
          "kernel_initializer": {
            "class_name": "VarianceScaling", 
            "config": {
              "distribution": "uniform", 
              "scale": 1.0, 
              "seed": null, 
              "mode": "fan_avg"
            }
          }, 
          "name": "conv1d_mask_1", 
          "bias_regularizer": null, 
          "bias_constraint": null, 
          "activation": "linear", 
          "trainable": true, 
          "padding": "same", 
          "strides": [
            1
          ], 
          "dilation_rate": [
            1
          ], 
          "kernel_regularizer": null, 
          "filters": 50, 
          "bias_initializer": {
            "class_name": "Zeros", 
            "config": {}
          }, 
          "use_bias": true, 
          "activity_regularizer": null, 
          "kernel_size": [
            3
          ]
        }, 
        "inbound_nodes": [
          [
            [
              "embedding_1", 
              0, 
              0, 
              {}
            ]
          ]
        ], 
        "name": "conv1d_mask_1"
      }, 
      {
        "class_name": "InputLayer", 
        "config": {
          "dtype": "float32", 
          "batch_input_shape": [
            null, 
            416
          ], 
          "name": "input_word", 
          "sparse": false
        }, 
        "inbound_nodes": [], 
        "name": "input_word"
      }, 
      {
        "class_name": "MaxPooling1DMask", 
        "config": {
          "padding": "same", 
          "strides": [
            7
          ], 
          "trainable": true, 
          "name": "max_pooling1d_mask_1", 
          "pool_size": [
            7
          ]
        }, 
        "inbound_nodes": [
          [
            [
              "conv1d_mask_1", 
              0, 
              0, 
              {}
            ]
          ]
        ], 
        "name": "max_pooling1d_mask_1"
      }, 
      {
        "class_name": "Embedding", 
        "config": {
          "embeddings_initializer": {
            "class_name": "RandomUniform", 
            "config": {
              "maxval": 0.05, 
              "seed": null, 
              "minval": -0.05
            }
          }, 
          "name": "word_emb", 
          "dtype": "float32", 
          "output_dim": 50, 
          "trainable": true, 
          "embeddings_regularizer": null, 
          "input_dim": 7000, 
          "mask_zero": true, 
          "embeddings_constraint": null, 
          "batch_input_shape": [
            null, 
            null
          ], 
          "activity_regularizer": null, 
          "input_length": null
        }, 
        "inbound_nodes": [
          [
            [
              "input_word", 
              0, 
              0, 
              {}
            ]
          ]
        ], 
        "name": "word_emb"
      }, 
      {
        "class_name": "GatePositional", 
        "config": {
          "trainable": true, 
          "name": "gate_positional_1"
        }, 
        "inbound_nodes": [
          [
            [
              "max_pooling1d_mask_1", 
              0, 
              0, 
              {}
            ], 
            [
              "word_emb", 
              0, 
              0, 
              {}
            ]
          ]
        ], 
        "name": "gate_positional_1"
      }, 
      {
        "class_name": "Dense", 
        "config": {
          "kernel_initializer": {
            "class_name": "VarianceScaling", 
            "config": {
              "distribution": "uniform", 
              "scale": 1.0, 
              "seed": null, 
              "mode": "fan_avg"
            }
          }, 
          "name": "dense_1", 
          "kernel_constraint": null, 
          "bias_regularizer": null, 
          "bias_constraint": null, 
          "activation": "linear", 
          "trainable": true, 
          "kernel_regularizer": null, 
          "bias_initializer": {
            "class_name": "Zeros", 
            "config": {}
          }, 
          "units": 50, 
          "use_bias": true, 
          "activity_regularizer": null
        }, 
        "inbound_nodes": [
          [
            [
              "gate_positional_1", 
              0, 
              0, 
              {}
            ]
          ]
        ], 
        "name": "dense_1"
      }, 
      {
        "class_name": "Conv1DMask", 
        "config": {
          "kernel_constraint": null, 
          "kernel_initializer": {
            "class_name": "VarianceScaling", 
            "config": {
              "distribution": "uniform", 
              "scale": 1.0, 
              "seed": null, 
              "mode": "fan_avg"
            }
          }, 
          "name": "conv1d_mask_2", 
          "bias_regularizer": null, 
          "bias_constraint": null, 
          "activation": "linear", 
          "trainable": true, 
          "padding": "same", 
          "strides": [
            1
          ], 
          "dilation_rate": [
            1
          ], 
          "kernel_regularizer": null, 
          "filters": 50, 
          "bias_initializer": {
            "class_name": "Zeros", 
            "config": {}
          }, 
          "use_bias": true, 
          "activity_regularizer": null, 
          "kernel_size": [
            3
          ]
        }, 
        "inbound_nodes": [
          [
            [
              "dense_1", 
              0, 
              0, 
              {}
            ]
          ]
        ], 
        "name": "conv1d_mask_2"
      }, 
      {
        "class_name": "Dropout", 
        "config": {
          "rate": 0.5, 
          "noise_shape": null, 
          "trainable": true, 
          "seed": null, 
          "name": "dropout_1"
        }, 
        "inbound_nodes": [
          [
            [
              "conv1d_mask_2", 
              0, 
              0, 
              {}
            ]
          ]
        ], 
        "name": "dropout_1"
      }, 
      {
        "class_name": "MeanOverTime", 
        "config": {
          "mask_zero": true, 
          "trainable": true, 
          "name": "mean_over_time_1"
        }, 
        "inbound_nodes": [
          [
            [
              "dropout_1", 
              0, 
              0, 
              {}
            ]
          ]
        ], 
        "name": "mean_over_time_1"
      }, 
      {
        "class_name": "Dense", 
        "config": {
          "kernel_initializer": {
            "class_name": "VarianceScaling", 
            "config": {
              "distribution": "uniform", 
              "scale": 1.0, 
              "seed": null, 
              "mode": "fan_avg"
            }
          }, 
          "name": "dense", 
          "kernel_constraint": null, 
          "bias_regularizer": null, 
          "bias_constraint": null, 
          "activation": "linear", 
          "trainable": true, 
          "kernel_regularizer": null, 
          "bias_initializer": {
            "class_name": "Zeros", 
            "config": {}
          }, 
          "units": 1, 
          "use_bias": true, 
          "activity_regularizer": null
        }, 
        "inbound_nodes": [
          [
            [
              "mean_over_time_1", 
              0, 
              0, 
              {}
            ]
          ]
        ], 
        "name": "dense"
      }, 
      {
        "class_name": "Activation", 
        "config": {
          "activation": "sigmoid", 
          "trainable": true, 
          "name": "activation_1"
        }, 
        "inbound_nodes": [
          [
            [
              "dense", 
              0, 
              0, 
              {}
            ]
          ]
        ], 
        "name": "activation_1"
      }
    ], 
    "input_layers": [
      [
        "input_char", 
        0, 
        0
      ], 
      [
        "input_word", 
        0, 
        0
      ]
    ], 
    "output_layers": [
      [
        "activation_1", 
        0, 
        0
      ]
    ], 
    "name": "model_1"
  }, 
  "backend": "theano"
}